** Printing to the command line
When it comes to printing, there are two main ways. We can either use echo or we can use printf. Most of the time, printf is better since it gives us more control over the formatting of the outputted message. 

One important thing to note when it comes to the printf command is that it acts like a loop depending on how many arguments are passed to it. What I mean by this is that if we have a printf command that formats a string with 2 format specifiers included and then we provide it with 4 arguments then the string will be printed twice. Once with the first two and a second time with the second pair. Here is an example below.
#+BEGIN_SRC sh :result output
  #!/bin/bash

  #Printf called with more arguments than format specifiers present
  printf "Hello to you %s, and hello to you %s\n" "Yavor" "Konstantinov" "Bugs" "Bunny"
#+END_SRC

#+RESULTS:
| Hello to you Yavor | and hello to you Konstantinov |
| Hello to you Bugs  | and hello to you Bunny        |

An additional use of printf is to format input and store it in a variable WITHOUT printing to stdout. This is accomplished by calling it with the -v option and giving a variable name as well.
#+BEGIN_SRC sh
  #!/bin/bash
  printf -v myNum "Hello again %s\n" "Yavor"
  printf "Here is the value in the variable myNum: %s\n" "$myNum"
#+END_SRC

#+RESULTS:
: Here is the value in the variable myNum: Hello again Yavor

